src/Reports/ЗапросТКП/ЗапросТКП.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>ЗапросТКП</name>
  <comment>Запрос - поручение представления коммерческого предложения от потенциального поставщика предметов снабжения</comment>
</mdclass:Report>

src/Documents/Заявка/Заявка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Заявка</name>
  <comment>Заявки на поставку предметов снабжения</comment>
  <posting>Deny</posting>
  <attributes>
    <name>НомерЗаказчика</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Категория</name>
    <type>
      <types>CatalogRef.КатегорииЗаявокНаПоставкуПС</types>
    </type>
  </attributes>
  <attributes>
    <name>Корабли</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Примечание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПозиций</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РуководительПроектаВТС</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбщаяСуммаЗаявки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>14</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.ОКВ</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНазначенияДЗО</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИсполнительДЗО</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗагруженаССайта</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьТекущийЭтап</name>
    <type>
      <types>CatalogRef.ЭтапыВыполненияЗаявокНаПоставкуПредметовСнабжения</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьДатаТекущегоЭтапа</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗапросТКПRFP</name>
    <type>
      <types>DocumentRef.ЗапросТКПRFP</types>
    </type>
  </attributes>
  <attributes>
    <name>Заказы</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СпециалистДЭ</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Удалить_ЭтапыВыполненияЗаявки</name>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Этап</name>
      <type>
        <types>CatalogRef.ЭтапыВыполненияЗаявокНаПоставкуПредметовСнабжения</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Спецификация</name>
    <attributes>
      <name>ИдентификаторПозиции</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПредметСнабжения</name>
      <type>
        <types>CatalogRef.КаталогПредметовСнабжения</types>
      </type>
    </attributes>
    <attributes>
      <name>Изделие</name>
      <type>
        <types>CatalogRef.СтруктураЗаказаПоКомплектующимИзделиямИЗИП</types>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеПредметаСнабженияЗаказчика</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КодПредметаСнабженияЗаказчика</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеИзделияЗаказчика</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>8</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.ОКЕИ</types>
      </type>
    </attributes>
    <attributes>
      <name>ИсполнительДЗО</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаОСК</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>14</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОписаниеИерархииИзделия</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекущийЭтап</name>
      <type>
        <types>CatalogRef.ЭтапыВыполненияПунктовЗаявок</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаТекущегоЭтапа</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаТекущегоГода</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>14</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаСледующегоГода</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>14</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаГодаЧерез1</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>14</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИсточникЦеновойИнформации</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ОбоснованиеЦенообразования</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ПредметСнабженияИсходный</name>
      <type>
        <types>CatalogRef.КаталогПредметовСнабжения</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЭтапыВыполненияСпецификации</name>
    <attributes>
      <name>ИдентификаторПозиции</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Этап</name>
      <type>
        <types>CatalogRef.ЭтапыВыполненияПунктовЗаявок</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Проекты</name>
    <attributes>
      <name>Корабль</name>
      <type>
        <types>CatalogRef.ПроектыКораблей</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Reports/ЗапросТКП/Forms/ФормаОтчета/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ЗапросЗаявка", ЗапросЗаявка) Тогда
		
		УстановитьСписокВыбораПоставщиков();
		
		Если ТипЗнч(ЗапросЗаявка) = Тип("ДокументСсылка.Заявка") Тогда
			
			Поставщик = ЗапросЗаявка.ИсполнительДЗО;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьСписокВыбораПоставщиков()
	
	Поставщик = Справочники.Организации.ПустаяСсылка();
	Элементы.Поставщик.СписокВыбора.Очистить();
	
	Если ЗначениеЗаполнено(ЗапросЗаявка) Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЗаявкаСпецификация.ИсполнительДЗО КАК Поставщик
		|ИЗ
		|	Документ.Заявка.Спецификация КАК ЗаявкаСпецификация
		|ГДЕ
		|	ЗаявкаСпецификация.Ссылка В
		|			(ВЫБРАТЬ
		|				Заявка.Ссылка КАК Ссылка
		|			ИЗ
		|				Документ.Заявка КАК Заявка
		|			ГДЕ
		|				Заявка.ЗапросТКПRFP = &ЗапросЗаявка
		|		
		|			ОБЪЕДИНИТЬ ВСЕ
		|		
		|			ВЫБРАТЬ
		|				Заявка.Ссылка КАК Ссылка
		|			ИЗ
		|				Документ.Заявка КАК Заявка
		|			ГДЕ
		|				Заявка.Ссылка = &ЗапросЗаявка)
		|	И НЕ ЗаявкаСпецификация.ИсполнительДЗО = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)";
		Запрос.УстановитьПараметр("ЗапросЗаявка", ЗапросЗаявка);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Если Не РезультатЗапроса.Пустой() Тогда
			
			Элементы.Поставщик.СписокВыбора.ЗагрузитьЗначения(РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Поставщик"));
			
			Если ТипЗнч(ЗапросЗаявка) = Тип("ДокументСсылка.Заявка") Тогда
				
				Если ЗначениеЗаполнено(ЗапросЗаявка.ИсполнительДЗО) И Элементы.Поставщик.СписокВыбора.НайтиПоЗначению(ЗапросЗаявка.ИсполнительДЗО) = Неопределено Тогда
					
					Элементы.Поставщик.СписокВыбора.Добавить(ЗапросЗаявка.ИсполнительДЗО);
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьЗначениеПараметра(ИмяПараметра)
	
	ПараметрыОтчета = Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы;
	
	ПараметрОтчета = ПараметрыОтчета.Найти(ИмяПараметра);
	ПараметрОтчета.Использование = Истина;
	ПараметрОтчета.Значение = ЭтаФорма[ИмяПараметра];
	
	// ++ 23.05.2018 10:46:55 Базунов Д.А. Задача: 
	ВариантМодифицирован = Ложь;
	// -- 23.05.2018 10:46:55 Базунов Д.А. Задача:
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапросЗаявкаПриИзменении(Элемент)
	
	УстановитьСписокВыбораПоставщиков();
	УстановитьЗначениеПараметра("ЗапросЗаявка");
	УстановитьЗначениеПараметра("Поставщик");
	
КонецПроцедуры

&НаКлиенте
Процедура ПоставщикПриИзменении(Элемент)
	
	УстановитьЗначениеПараметра("ЗапросЗаявка");
	УстановитьЗначениеПараметра("Поставщик");
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ЗначениеЗаполнено(ЗапросЗаявка) Тогда
	
		УстановитьЗначениеПараметра("ЗапросЗаявка");
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Поставщик) Тогда
		
		УстановитьЗначениеПараметра("Поставщик");
		
	КонецЕсли;
	
	Результат.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	
КонецПроцедуры
